# 30.

In [ ]:
SQL - Write SQL query or by using Spark for the following scenario

In [ ]:
select * from matches;

In [ ]:
+-------+-------+--------+
| teama | teamb | winner |
+-------+-------+--------+
| ind   | pak   | ind    |
| ind   | sr    | sr     |
| ind   | aus   | ind    |
| aus   | ind   | aus    |
+-------+-------+--------+

In [ ]:
select team, count(*) as total, sum(is_win) as won,
       count(*) - sum(is_win) as lost
from ((select teama as team,
              (teama = winner) as is_win
       from matches
      ) union all
      (select teamb as team,
              (teamb = winner) as is_win
       from matches
      )
     ) c
group by team;

In [ ]:
+------+-------+------+------+
| team | total | won  | lost |
+------+-------+------+------+
| ind  |     4 |    2 |    2 |
| aus  |     2 |    1 |    1 |
| pak  |     1 |    0 |    1 |
| sr   |     1 |    1 |    0 |
+------+-------+------+------+

In [ ]:
select teama as team,
              (teama = winner) as is_win
       from matches

In [ ]:
+------+--------+
| team | is_win |
+------+--------+
| ind  |      1 |
| ind  |      0 |
| ind  |      1 |
| aus  |      1 |
+------+--------+

In [ ]:
select teamb as team,(teamb = winner) as is_win from matches;

In [ ]:
+------+--------+
| team | is_win |
+------+--------+
| pak  |      0 |
| sr   |      1 |
| aus  |      0 |
| ind  |      0 |
+------+--------+

In [ ]:
select teama as team,(teama = winner) as is_win from matches
union all select teamb as team,(teamb = winner) as is_win from matches;

In [ ]:
+------+--------+
| team | is_win |
+------+--------+
| ind  |      1 |
| ind  |      0 |
| ind  |      1 |
| aus  |      1 |
| pak  |      0 |
| sr   |      1 |
| aus  |      0 |
| ind  |      0 |
+------+--------+

In [ ]:
# final query with output

In [ ]:
select team, count(*) as total, sum(is_win) as won,
       count(*) - sum(is_win) as lost
from ((select teama as team,
              (teama = winner) as is_win
       from matches
      ) union all
      (select teamb as team,
              (teamb = winner) as is_win
       from matches
      )
     ) c
group by team;

In [ ]:
+------+-------+------+------+
| team | total | won  | lost |
+------+-------+------+------+
| ind  |     4 |    2 |    2 |
| aus  |     2 |    1 |    1 |
| pak  |     1 |    0 |    1 |
| sr   |     1 |    1 |    0 |
+------+-------+------+------+

# 31

In [ ]:
31.  SQL - Given the two dataset
a.User information (id, email, language, location)
b.Transaction information (transaction-id, product-id, user-id, purchase-amount, item-description)
Find the number of unique locations in which each product has been sold

In [ ]:
create table user(
    user_id int,
    email varchar(50),
    language varchar(20),
    location varchar(20)
)

In [ ]:
insert into user values(1000, 'xyz@gm.com', 'english', 'TN');
insert into user values(1001, 'abc@gm.com', 'english', 'Kerala');   
insert into user values(1002, 'y@gm.com', 'english', 'TN');   
insert into user values(1003, 'h@gm.com', 'english', 'Delhi');   
insert into user values(1004, 'ash@gm.com', 'english', 'Kerala');

In [ ]:
create table transaction(
        t_id int,
        product_id int,
        user_id int,
        purchase_amount float,
        descc varchar(20)
        );

In [ ]:
insert into transaction values (1234, 500, 1000, 1500.00, 'ItemA');
insert into transaction values (1213, 501, 1002, 2000.00, 'ItemB');
insert into transaction values (1776, 500, 1003, 1267.90, 'ItemA');
insert into transaction values (3345, 500, 1002, 2334.90, 'ItemA');
insert into transaction values (1245, 502, 1001, 4546.65, 'ItemC');
insert into transaction values (1513, 501, 1004, 2000.00, 'ItemB');
insert into transaction values (1113, 501, 1003, 2000.00, 'ItemB');

In [ ]:
# final query

In [ ]:
 select u.location, t.product_id from user u join transaction t on u.user_id = t.user_id;

In [ ]:
# output
+----------+------------+
| location | product_id |
+----------+------------+
| TN       |        500 |
| TN       |        501 |
| Delhi    |        500 |
| TN       |        500 |
| Kerala   |        502 |
| Kerala   |        501 |
| Delhi    |        501 |
+----------+------------+
7 rows in set (0.00 sec)

# 32

In [ ]:
32.  SQL -
#  for this question
# the logic could be get the reminder

In [ ]:
72%8

In [ ]:
20%8

In [ ]:
21%8

In [ ]:
9%8

In [ ]:
32.  SQL -
72 seats per compartment, with 8 types of seats,
L M U L M U SL SU
1 2  3  4 5  6  7   8

seat_num = 20  (input)
no_of_diff_seats = 8

Given a seat number find the type of seat (example for seatnum= 20 its 4)

In [ ]:
seat(10)

In [ ]:
create table seat(
seat_type varchar(10),
    seat_sr_no int
);

In [ ]:
L M U L M U SL SU
1 2  3  4 5  6  7   8

In [ ]:
insert into seat values('L',1);
insert into seat values('M',2);
insert into seat values('U',3);
insert into seat values('L',4);
insert into seat values('M',5);
insert into seat values('U',6);
insert into seat values('SL',7);
insert into seat values('SU',8);

In [ ]:
#  QUERY AND FUNCTION FOR THE SAME PROBLEM

In [ ]:
# 18 in consider as user input data

In [ ]:
select seat_type, seat_sr_no, MOD( 18, 8) AS seat_num from seat;

In [ ]:
+-----------+------------+----------+
| seat_type | seat_sr_no | seat_num |
+-----------+------------+----------+
| L         |          1 |        2 |
| M         |          2 |        2 |
| U         |          3 |        2 |
| L         |          4 |        2 |
| M         |          5 |        2 |
| U         |          6 |        2 |
| SL        |          7 |        2 |
| SU        |          8 |        2 |
+-----------+------------+----------+

In [ ]:
select seat_type, seat_sr_no, CASE WHEN MOD( 18, 8)=seat_sr_no THEN seat_type ELSE 0 END AS seat_num from seat;

In [ ]:
+-----------+------------+----------+
| seat_type | seat_sr_no | seat_num |
+-----------+------------+----------+
| L         |          1 | 0        |
| M         |          2 | M        |
| U         |          3 | 0        |
| L         |          4 | 0        |
| M         |          5 | 0        |
| U         |          6 | 0        |
| SL        |          7 | 0        |
| SU        |          8 | 0        |
+-----------+------------+----------+

In [ ]:
def seat(input):
#     get the reminder by dividing 8 
    seat_no = input%8
#     if the reminder is zero means number is divisable by 8 the return 8
    if seat_no==0:
        return 8
#     if reminder is not zero means that is required seat number 
    elif seat_no != 0:
        return seat_no

In [ ]:
seat(9)

# 33

In [ ]:
33.	SQL – Write SQL for below scenario
emp id, emp name, mgr_id
1,Vishal,3
2,Rohit,3
3,Shreyank,4
5,Viswa,NULL

Find below details :  emp_id, emp_name, mgr’s_mgr_name
ex-  1,Vishal, Viswa

In [ ]:
create table employee(
emp_id int,
    emp_name varchar(20),
    mgr_id int
);

In [ ]:
insert into employee values (1,'Vishal',3);
insert into employee values (2,'Rohit',3);
insert into employee values (3,'Shreyank',4);
insert into employee values (5,'Viswa',null);

In [ ]:
select m.emp_id, m.emp_name, e.emp_name as managerName
FROM Employee e
        JOIN Employee m ON e.emp_id = m.mgr_id ;

In [ ]:
+--------+----------+-------------+
| emp_id | emp_name | managerName |
+--------+----------+-------------+
|      1 | Vishal   | Shreyank    |
|      2 | Rohit    | Shreyank    |
+--------+----------+-------------+
2 rows in set (0.00 sec)

In [ ]:
select * from employee;
+--------+----------+--------+
| emp_id | emp_name | mgr_id |
+--------+----------+--------+
|      1 | Vishal   |      3 |
|      2 | Rohit    |      3 |
|      3 | Shreyank |      4 |
|      5 | Viswa    |   NULL |
+--------+----------+--------+
4 rows in set (0.00 sec)

## PYSPARK

## PYSPARK

In [6]:
import findspark
findspark.init()
from pyspark.sql import SparkSession

spark = SparkSession.\
             builder.\
             master('local').\
             appName('sample').\
             getOrCreate()

In [7]:
spark

# 36

In [ ]:
36. Pyspark - set top box data
 Find the session time for per user and session.

In [ ]:
schm="""user_id int,session_id int,action string,time string"""

In [ ]:
data = [
    (1,123, 'turned on', '11:00'),
(1, 123, 'movie1','11:01'),
(1, 123, 'movie2','11:02'),
(1, 123, 'turned off','11:03')
  ]

In [ ]:
df = spark.createDataFrame(data,schema=schm)

In [ ]:
df.printSchema()

In [ ]:
df.show()

In [ ]:
from pyspark.sql.functions import sum, expr, regexp_replace, col

In [ ]:
df.select("*").withColumn("time", regexp_replace(col("time"), "[:]", "").cast("int").alias("replaced")).show()

In [ ]:
df.select("*").withColumn("time", regexp_replace(col("time"), "[:]", "").cast("int").alias("replaced")).\
              withColumn('start_session', expr("""CASE WHEN action = 'turned on' THEN time else 0 end""")).\
              withColumn('end_session', expr("""CASE WHEN action = 'turned off' THEN time else 0 end"""))\
              .groupBy('user_id', 'session_id').\
               agg(sum('start_session').cast('int').alias('start'), sum('end_session').cast('int').alias('end')).\
               select('*').withColumn("session_time", col('end')-col('start')).show()

# 37

In [ ]:
37. Pyspark - Read a csv file in spark and while writing it should write the data
              in only 4 parttiions and save it in parquet.

In [45]:
schema = """order_id int, order_date date, order_customer_id int, order_status string"""

In [46]:
orders = spark.read.csv(r'C:\Users\Kshitij kadu\Desktop\sample_data\retail_csv\orders', schema)

In [49]:
orders.rdd.getNumPartitions()

1

In [51]:
orders.repartition(4).write.parquet(r"C:\Users\Kshitij kadu\Desktop\write\order")

# 38

In [ ]:
38. Pyspark – Read CSV file and Hive Table. Join both of them based on a common key column (id).
    Apply a filter after joining (flag=1). Store that result back into another Hive table.

In [14]:
schema = """order_id int, order_date date, order_customer_id int, order_status string"""

In [16]:
orders = spark.read.csv(r'C:\Users\Kshitij kadu\Desktop\sample_data\retail_csv\orders', schema)

In [ ]:
# order_items = spark.sql("SELECT * FROM order_items")

In [23]:
order_items = spark.read.json(r'C:\Users\Kshitij kadu\Desktop\sample_data\retail_db_json\order_items')

In [ ]:
order_items.printSchema()

In [25]:
orders_join = orders.join( order_items, 
                              on=orders.order_id == order_items.order_item_order_id
                            )

In [ ]:
orders_join.printSchema()

In [29]:
filter_orders = orders_join.filter("order_item_subtotal > 1000")

save the df to hive table

In [ ]:
filter_orders.write.saveAsTable("table_name", mode = 'append')

In [ ]:
help(filter_orders.write.saveAsTable)

# 39

In [ ]:
39. Pyspark - Write a pyspark code to get name of customer who didn't order anything?

In [ ]:
create req. dataframes

In [35]:
custoner_data = [(1, 'joe'),(2,"Henry"),(3,"Sam"),(4,"Max")]
customer_schema = """c_id int, c_name string"""
c_df = spark.createDataFrame(custoner_data, customer_schema)

In [37]:
order_data = [(1,3),(2,1)]
order_schema = """o_id int, o_c_id int"""
o_df = spark.createDataFrame(order_data, order_schema)

In [41]:
co_join = c_df.join(o_df, on = c_df.c_id == o_df.o_c_id, how='left')

In [42]:
co_join.show()

+----+------+----+------+
|c_id|c_name|o_id|o_c_id|
+----+------+----+------+
|   1|   joe|   2|     1|
|   3|   Sam|   1|     3|
|   4|   Max|null|  null|
|   2| Henry|null|  null|
+----+------+----+------+

In [44]:
co_join.filter("o_id is null").show()

+----+------+----+------+
|c_id|c_name|o_id|o_c_id|
+----+------+----+------+
|   4|   Max|null|  null|
|   2| Henry|null|  null|
+----+------+----+------+